# Задача: вывести на экран все степени 2, не превосходяшие 100
i = 1;
while i <= 100:
    print(i);
    i *= 2;
