# Арифметические операторы в Python

# + (плюс) сложение:

total = 5 + 9
print("Операция сложения")
print("5 + 9 = ", total)

# либо так:
a = 5
b = 9  
a += b # Вычисление результата
print("a += b = ", a, "\n") # \n символ перехода на новую строку

# - (минус) вычитание
total = 10 - 3
print("Операция вычитания")
print("10 - 3 = ", total)

# либо так:
a = 10
b = 3
a -= b
print("a -= b = ", a, "\n")
# * (умножить) произведение
total = 3 * 3
print("Операция произвеведния")
print("3 * 3 = ", total)
# либо так:
a = 3
b = 3
a *= b
print("a *= b = ", a, "\n")

# / (разделить) деление
total = 14 / 2
print("Операция деления")
print("14 : 2 = ", total)
# либо так
a = 14
b = 2
a /= b
print("a /= b = ", a, "\n")

print("Получение целой части от деления: ")
total = 9 // 3
print("9 // 3 = ", total, "\n")

# Получение остатка от деления:
print("Получение остатка от деления: ")
total = 9 % 5
print("9 % 5 = ", total, "\n")

# Возведение в степень:
print("Возведение в степень: ")
total = 5 ** 4
print("5 ** 4 = ", total, "\n")

